#### Terraform Format 🖌 `success`
#### Terraform Init ⚙️ `success`
#### Terraform Validate 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.scp_manager.aws_organizations_policy.limit_regions: Refreshing state... [id=p-02s3te0u]
module.scp_manager.aws_organizations_policy.nuke_supported_services: Refreshing state... [id=p-7pd0szg9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.scp_manager.aws_organizations_policy.cost_avoidance[0] will be created
  + resource "aws_organizations_policy" "cost_avoidance" {
      + arn         = (known after apply)
      + content     = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                        ]
                      + Condition = {
                          + ArnNotLike                  = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + "ForAnyValue:StringNotLike" = {
                              + "ec2:InstanceType" = [
                                  + "t2.micro",
                                  + "t2.small",
                                  + "t2.medium",
                                  + "t3.micro",
                                  + "t3.small",
                                  + "t3.medium",
                                  + "t3.large",
                                  + "t3a.micro",
                                  + "t3a.small",
                                  + "t3a.medium",
                                  + "t3a.large",
                                  + "m5.large",
                                  + "m5.xlarge",
                                  + "m6i.large",
                                  + "m6i.xlarge",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:instance/*",
                        ]
                      + Sid       = "DenyLargeEC2Instances"
                    },
                  + {
                      + Action    = [
                          + "sagemaker:CreateEndpoint",
                          + "sagemaker:CreateEndpointConfig",
                          + "sagemaker:CreateTrainingJob",
                          + "sagemaker:CreateHyperParameterTuningJob",
                          + "elasticmapreduce:RunJobFlow",
                          + "gamelift:CreateFleet",
                          + "redshift:CreateCluster",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "DenyExpensiveServices"
                    },
                  + {
                      + Action    = [
                          + "eks:CreateNodegroup",
                          + "eks:UpdateNodegroupConfig",
                        ]
                      + Condition = {
                          + ArnNotLike         = {
                              + "aws:PrincipalARN" = [
                                  + "arn:aws:iam::*:role/InnovationSandbox-ndx*",
                                  + "arn:aws:iam::*:role/aws-reserved/sso.amazonaws.com/*AWSReservedSSO_ndx_IsbAdmins*",
                                  + "arn:aws:iam::*:role/stacksets-exec-*",
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                ]
                            }
                          + NumericGreaterThan = {
                              + "eks:maxSize" = "5"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = [
                          + "*",
                        ]
                      + Sid       = "LimitEKSNodegroupSize"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + description = "SCP to prevent runaway costs by limiting instance sizes and expensive operations. MANAGED BY TERRAFORM."
      + id          = (known after apply)
      + name        = "InnovationSandboxCostAvoidanceScp"
      + tags        = {
          + "Component" = "SCP-Overrides"
        }
      + tags_all    = {
          + "Component"   = "SCP-Overrides"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
          + "Repository"  = "terraform-scp-overrides"
        }
      + type        = "SERVICE_CONTROL_POLICY"
    }

  # module.scp_manager.aws_organizations_policy.limit_regions will be updated in-place
  ~ resource "aws_organizations_policy" "limit_regions" {
      ~ content     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "*" -> [
                          + "*",
                        ]
                      ~ Condition = {
                          ~ StringNotEquals = {
                              ~ "aws:RequestedRegion" = [
                                  - "us-west-2",
                                    "us-east-1",
                                  + "us-west-2",
                                  + "eu-west-2",
                                ]
                            }
                            # (1 unchanged attribute hidden)
                        }
                      ~ Resource  = "*" -> [
                          + "*",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ description = "Service Control Policy (SCP) for Innovation Sandbox to limit use of AWS Regions." -> "SCP to limit use of AWS Regions. Includes Bedrock inference profile exception. MANAGED BY TERRAFORM."
        id          = "p-02s3te0u"
        name        = "InnovationSandboxLimitRegionsScp"
      ~ tags        = {
          + "Component"            = "SCP-Overrides"
          - "aws-solutions:isb-id" = "ndx_isb" -> null
        }
      ~ tags_all    = {
          + "Component"            = "SCP-Overrides"
          + "Environment"          = "production"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "NDX"
          + "Repository"           = "terraform-scp-overrides"
          - "aws-solutions:isb-id" = "ndx_isb" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.scp_manager.aws_organizations_policy.nuke_supported_services will be updated in-place
  ~ resource "aws_organizations_policy" "nuke_supported_services" {
      ~ content     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ NotAction = [
                            # (126 unchanged elements hidden)
                            "storagegateway:*",
                          + "transcribe:*",
                          + "transfer:*",
                          + "waf:*",
                          + "wafv2:*",
                          + "workspaces:*",
                          + "xray:*",
                            "textract:AnalyzeDocument",
                            # (12 unchanged elements hidden)
                            "textract:ListTagsForResource",
                          - "transcribe:*",
                          - "transfer:*",
                          - "waf:*",
                          - "wafv2:*",
                          - "workspaces:*",
                          - "xray:*",
                        ]
                      ~ Resource  = "*" -> [
                          + "*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ description = "Service Control Policy (SCP) to allow only services supported by AWS Nuke clean workflow. " -> "SCP to allow only services supported by AWS Nuke clean workflow. MANAGED BY TERRAFORM."
        id          = "p-7pd0szg9"
        name        = "InnovationSandboxAwsNukeSupportedServicesScp"
      ~ tags        = {
          + "Component"            = "SCP-Overrides"
          - "aws-solutions:isb-id" = "ndx_isb" -> null
        }
      ~ tags_all    = {
          + "Component"            = "SCP-Overrides"
          + "Environment"          = "production"
          + "ManagedBy"            = "Terraform"
          + "Project"              = "NDX"
          + "Repository"           = "terraform-scp-overrides"
          - "aws-solutions:isb-id" = "ndx_isb" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # module.scp_manager.aws_organizations_policy_attachment.cost_avoidance[0] will be created
  + resource "aws_organizations_policy_attachment" "cost_avoidance" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-2laj-lha5vsam"
    }

  # module.scp_manager.aws_organizations_policy_attachment.limit_regions will be created
  + resource "aws_organizations_policy_attachment" "limit_regions" {
      + id        = (known after apply)
      + policy_id = "p-02s3te0u"
      + target_id = "ou-2laj-lha5vsam"
    }

  # module.scp_manager.aws_organizations_policy_attachment.nuke_supported_services will be created
  + resource "aws_organizations_policy_attachment" "nuke_supported_services" {
      + id        = (known after apply)
      + policy_id = "p-7pd0szg9"
      + target_id = "ou-2laj-lha5vsam"
    }

Plan: 4 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ scp_policy_ids = {
      + cost_avoidance          = (known after apply)
        # (2 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*